Homework_5/models/tables/Task.php

    public static function getUserTasksByMonth($user_id, $year, $month){
        return $tasksResult = \app\models\tables\Task::find()
                ->where(['user_id' => $user_id])
                ->andWhere(['YEAR(`date`)' => $year])
                ->andWhere(['MONTH(`date`)' => $month])
                ->all();
---
SELECT * FROM `tasks` WHERE (`user_id`=7) AND (YEAR(`date`)='2018') AND (MONTH(`date`)='06')