Homework_4/models/User.php

    public static function findIdentity($id)
    {
        $result = tables\User::findOne($id);
---
SELECT * FROM `users` WHERE `id`=7