Homework_4/controllers/TaskController.php

    public function actionIndex(){

        // Получаем пользователя и проверяем авторизацию
        $user_id = \Yii::$app->user->id;
        if(!$user_id){
            return $this->render('_notLoggedIn');
        }

        // Получаем месяц-год с предварительной установкой верного времени
        date_default_timezone_set('Europe/Moscow'); // Постоянно съезжает на час. В рунете говорят, что из-за переводов часов.
        if($date = \Yii::$app->request->post('date')){
            $year = mb_substr($date, 0, 4);
            $month = mb_substr($date, 5, 2);
        }else{
            $date = date("Y-m-d", time());
            $year = date('Y');
            $month = date('m');
        }

        // Убрать в актив рекорд Task
        $tasksResult = \app\models\tables\Task::find()
                ->where(['user_id' => $user_id])
                ->andWhere(['YEAR(`date`)' => $year])
                ->andWhere(['MONTH(`date`)' => $month])
                ->all();
---
SELECT * FROM `tasks` WHERE (`user_id`=7) AND (YEAR(`date`)='2018') AND (MONTH(`date`)='06')

    public function actionCreate(){

        $model = new \app\models\tables\Task();
        $model->setScenario(\app\models\tables\Task::SCENARIO_ADMIN);


        $modelInsertHandler = function($event){
            $user = \app\models\tables\User::findOne($event->sender->user_id);
---
SELECT EXISTS(SELECT * FROM `users` WHERE `users`.`id`='7')